espressif/esp-idf/components/soc/esp32s31/include/soc/lp_gpio_sig_map.h
/*
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0 OR MIT
 */

#pragma once

#define LP_I2C_SCL_PAD_IN_IDX                   0
#define LP_I2C_SCL_PAD_OUT_IDX                  0
#define LP_I2C_SDA_PAD_IN_IDX                   1
#define LP_I2C_SDA_PAD_OUT_IDX                  1
#define LP_UART_RXD_PAD_IN_IDX                  2
#define LP_UART_TXD_PAD_OUT_IDX                 2
#define LP_UART_CTSN_PAD_IN_IDX                 3
#define LP_UART_RTSN_PAD_OUT_IDX                3
#define LP_UART_DSRN_PAD_IN_IDX                 4
#define LP_UART_DTRN_PAD_OUT_IDX                4
#define LP_SPI_CK_PAD_IN_IDX                    5
#define LP_SPI_CK_PAD_OUT_IDX                   5
#define LP_SPI_CS_PAD_IN_IDX                    6
#define LP_SPI_CS_PAD_OUT_IDX                   6
#define LP_SPI_D_PAD_IN_IDX                     7
#define LP_SPI_D_PAD_OUT_IDX                    7
#define LP_SPI_Q_PAD_IN_IDX                     8
#define LP_SPI_Q_PAD_OUT_IDX                    8
#define DTMUX_DCDC_IDX                          9
#define LP_PROBE_TOP_OUT0_IDX                   14
#define LP_PROBE_TOP_OUT1_IDX                   15
#define LP_PROBE_TOP_OUT2_IDX                   16
#define LP_PROBE_TOP_OUT3_IDX                   17
#define LP_PROBE_TOP_OUT4_IDX                   18
#define LP_PROBE_TOP_OUT5_IDX                   19
#define LP_PROBE_TOP_OUT6_IDX                   20
#define LP_PROBE_TOP_OUT7_IDX                   21
#define LP_PROBE_TOP_OUT8_IDX                   22
#define LP_PROBE_TOP_OUT9_IDX                   23
#define LP_PROBE_TOP_OUT10_IDX                  24
#define LP_PROBE_TOP_OUT11_IDX                  25
#define LP_PROBE_TOP_OUT12_IDX                  26
#define LP_PROBE_TOP_OUT13_IDX                  27
#define LP_PROBE_TOP_OUT14_IDX                  28
#define LP_PROBE_TOP_OUT15_IDX                  29
// version date 2506050
#define LP_SIG_GPIO_OUT_IDX                     32
